import React from "react";
import Card from "./Card";

function CardList() {
    return(
        <React.Fragment>
            <Card
                title="Dr.Strange"
                src="https://img.championat.com/s/732x488/news/big/i/w/obzor-doktora-strendzha-2_16519330471083426455.jpg"
                text="Стивен Стрэндж был талантливым нейрохирургом, но при этом человеком он был самовлюблённым и самонадеянным. Стрэндж мог стать знаменитым врачом, но на одном торжественном вечере напился, а затем, возвращаясь домой, попал в автомобильную аварию: Стивен не справился с управлением машины, и она врезалась в столб. Он получил сильное повреждение обеих рук, из-за которого карьера Стивена как нейрохирурга закончилась. Желая остаться врачом, будущий магистр мистических наук отправляется в путешествие по миру на поиски средства исцеления для своих рук. Путешествуя, Стрэндж узнал об одном человеке по имени Древний, живущем в Тибете и способном творить чудеса. Древний отказывается исцелять Стивена, он говорит, что тот должен заняться изучением магии и сам найти исцеление. Разозлённый отказом, Стрэндж собирается уйти из замка Древнего, но, проходя мимо одной из комнат, он видит ученика Древнего — барона Мордо, который готовится убить своего учителя. Стивен предупреждает Древнего о готовящемся покушении, тем самым спасая волшебнику жизнь. Мордо бежит из замка Древнего, который предлагает Стрэнджу стать его новым учеником."
            />
            <Card
                title="Spider-man"
                src="https://809620.selcdn.ru/wallpaperio-net/wallpapers/full/421ffca451d6da1a47549f21a996aedd.jpg"
                text="Человек-Паук (англ. Spider-Man) - персонаж комиксов Marvel Comics, супергерой, борец с преступностью и участник нескольких супергеройских команд. Первым и действующим Человеком-Пауком является Питер Паркер (англ. Peter Parker). Его в этом качестве на некоторое время заменяли его клон Бен Райли (англ. Ben Reilly) и его враг Отто Октавиус (англ. Otto Octavius), сумевший перенести свой разум в тело Питера. Также у Человека-Паука было несколько подражателей, включая МакДональда Гаргана и Ай-Апака из команд Тёмных Мстителей."
            />
            <Card
                title="Ironman"
                src="https://mir-s3-cdn-cf.behance.net/project_modules/max_1200/8f20a2125369651.6117b5e015cf8.jpg"
                text="Энтони Эдвард Старк был эксцентричным гением, миллиардером, ловеласом и филантропом. Использовав своё собственное богатство и свои технические знания, он так и был человеком не знающий проблем, пока его не похитила террористическая организация Десять колец. С помощью учёного Хо Инсена Тони создал огромный бронированный костюм, убил похитителей и сбежал. После побега Тони решил стать супергероем в бронированном костюме, известным как Железный человек (англ. Iron Man). Он сражался с различными террористами и со своим бывшим бизнес-партнёром Обадайей Стейном. Старк наслаждался своей популярностью, как Железный человек, но позже он решил раскрыть свою супергеройскую личность всему миру."
            />
            <Card
                title="Batman"
                src="https://ironusa.vtexassets.com/arquivos/ids/207379/090437_1.jpg?v=638139711705970000"
                text="В детстве, став свидетелем убийства своих родителей, Брюс поклялся посвятить свою жизнь искоренению преступности и борьбе за справедливость. Подготовив себя физически и морально, он надевает стилизованный костюм летучей мыши и выходит на улицы города для противостояния преступникам.
Место действия историй о Бэтмене — вымышленный американский город Готэм, созданный на основе Чикаго с элементами Нью-Йорка.
При содействии нескольких второстепенных персонажей, в том числе его напарника Робина, дворецкого Альфред, комиссара полиции Джеймса Гордона, а также иногда супергероини Бэтгёрл, Бэтмен противостоит группе злодеев, среди которых Джокер, Двуликий, Ядовитый Плющ, Пингвин, Пугало и Женщина-кошка.
В отличие от большинства супергероев, Бэтмен не обладает сверхспособностями, а использует свой интеллект, навыки боевых искусств, шпионажа, познания в науке и технике, а также несгибаемую волю, способность внушать страх и запугивать своих врагов.

"
            />
        </React.Fragment>
    )
}

export default CardList